scraping-an-spa.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-23 Sat 00:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Scraping an SPA</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Scraping an SPA</h1>
<p>
I recently needed to scrape some data from
<a href="https://mapping.ncua.gov/ResearchCreditUnion">https://mapping.ncua.gov/ResearchCreditUnion</a>. I hadn't done any web
scraping in years, so I made this guide to document the process.
</p>

<div id="outline-container-orgf26d56e" class="outline-2">
<h2 id="orgf26d56e">First Steps</h2>
<div class="outline-text-2" id="text-orgf26d56e">
<p>
The data I need is for credit unions that meet certain criteria. I can
use the site's search filters to yield only the results I want&#x2013;on the
order of 100 out of over 20,000. The search page is an SPA
("search" just changes what's rendered instead of visiting a
new page) but each result links to a new page.
</p>

<p>
I notice some custom HTML attributes<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> along the lines of
<kbd>_ngcontent-fsp-c114</kbd> throughout the page. A web search
reveals them to be generated by <a href="https://angularjs.org/">Angular.js</a>. So how do you scrape an
Angular SPA?
</p>
</div>
</div>

<div id="outline-container-org5ff5ffd" class="outline-2">
<h2 id="org5ff5ffd">Scraping with Puppeteer</h2>
<div class="outline-text-2" id="text-org5ff5ffd">
<p>
Some research turns up a few tools for scraping a dynamic website:
</p>
<ul class="org-ul">
<li><a href="https://github.com/assaf/zombie">Zombie.js</a></li>
<li><a href="https://github.com/SeleniumHQ/selenium">selenium</a> (often used as a python library in the context of scraping)</li>
<li><a href="https://github.com/puppeteer/puppeteer">puppeteer</a></li>
</ul>

<p>
Puppeteer seems to be the most widely used, so I'll pick a nice <a href="https://www.toptal.com/puppeteer/headless-browser-puppeteer-tutorial">tutorial</a>
and get started. Before running anything I'll check for a
<kbd>robots.txt</kbd>. There isn't one, so here we go!
</p>

<p>
First I make a project directory and install puppeteer:
</p>
<div class="org-src-container">
<pre class="src src-bash">mkdir scrape-spa
cd scrape-spa
npm i puppeteer --save
</pre>
</div>

<p>
I try and run some code from the tutorial that visits a page and
generates a screenshot. After a small change to generate a larger
screenshot, I have:
</p>

<div class="org-src-container">
<pre class="src src-javascript">const puppeteer = require('puppeteer');
const url = process.argv[2];
if (!url) {
    throw "Please provide URL as a first argument";
}
async function run () {
    const browser = await puppeteer.launch();
    const page = await browser.newPage();
    await page.goto(url);
    await page.setViewport({
        width: 1080,
        height: 2160,
        deviceScaleFactor: 1,
    });
    await page.screenshot({path: 'screenshot.png'});
    browser.close();
}
run();
</pre>
</div>

<p>
It works! Now for interacting with the page. Since I'm working in the
dark, I'll try and issue a click to the page and then take a
screenshot to display the result. By looking at the page source, I
identify an attribute of the HTML element I want to click:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;mat-select _ngcontent-jcn-c114="" role="combobox" aria-autocomplete="none" aria-haspopup="true" name="cuStatus" formcontrolname="cuStatus" class="mat-select ng-tns-c47-9 ng-tns-c30-8 mat-select-empty ng-untouched ng-pristine ng-valid ng-star-inserted" aria-labelledby="mat-form-field-label-11 mat-select-value-3" id="mat-select-2" tabindex="0" aria-expanded="false" aria-required="false" aria-disabled="false" aria-invalid="false"&gt;...&lt;/mat-select&gt;
</pre>
</div>

<p>
I can then programmatically find this element with puppeteer and issue
a click<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-javascript">const dropdown = await page.$('[name="cuStatus"]');
await dropdown.click();
</pre>
</div>

<p>
So far so good. Manually clicking this dropdown adds some new elements
to the DOM. I've got to click one of these to make a selection:
</p>

<div class="org-src-container">
<pre class="src src-javascript">const [selection] = await page.$x("//span[contains(., 'Active')]");
if (selection) {
    await selection.click();
}
</pre>
</div>

<p>
It's not clear from the screenshot that this worked; but, by adding a
wait interval between the click and the screenshot, it is:
</p>

<div class="org-src-container">
<pre class="src src-javascript">await page.waitForTimeout(1000);
</pre>
</div>

<p>
We can manipulate the other fields similarly until we are ready to
perform the search. Then we find the button and click:
</p>

<div class="org-src-container">
<pre class="src src-javascript">const [button] = await page.$x("//button[@title=\"find more details\"]/span[contains(., 'FIND')]")
if (button) {
    await button.click();
}
</pre>
</div>

<p>
Executing the search populates the page with the first 20 search
results, and displays buttons for navigating to the rest. Each result
contains a button that links to the corresponding page, where the data
I need is located. So we need to:
</p>
<ul class="org-ul">
<li>scrape the hyperlink value off of each result</li>
<li>click to continue to the next page (if necessary) and repeat</li>
</ul>

<p>
Scraping the hyperlink can be done like this<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>:
</p>
<div class="org-src-container">
<pre class="src src-javascript">let links = []
const buttons = await page.$x("//a/span[contains(., 'VIEW')]/..");
for( let button of buttons ) {
    const attr = await page.evaluate(el =&gt; el.getAttribute("href"), button);
    links.push("https://mapping.ncua.gov".concat(attr)) // not sure this is nec.
}
</pre>
</div>

<p>
Unfortunately this approach results in exactly two copies of each link,
because the table of search results exists in the DOM twice:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;div _ngcontent-fsp-c114="" tabindex="0" class="tb-desktop-container"&gt;...&lt;/div&gt;
&lt;div _ngcontent-fsp-c114="" tabindex="0" class="tb-mobile-container"&gt;...&lt;/div&gt;
</pre>
</div>

<p>
I can fix this with the following spaghetti code<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>:
</p>

<div class="org-src-container">
<pre class="src src-javascript">let links = [];
let next = null;
do {
    let newLinks = []
    const [nextButton] = await page.$x("//button[@aria-label=\"Next page\" and not(@disabled)]");
    next = nextButton;
    const buttons = await page.$x("//a/span[contains(., 'VIEW')]/..");
    for( let b of buttons ) {
        const attr = await page.evaluate(el =&gt; el.getAttribute("href"), b);
        newLinks.push("https://mapping.ncua.gov".concat(attr))
    }
    newLinks = newLinks.slice(0,newLinks.length/2)
    links = links.concat(newLinks)
    if (next) {
        await next.click();
        await page.waitForTimeout(1000);
    }
} while (next);
</pre>
</div>

<p>
I've conquered the SPA! Now it's time to visit all the scraped links
and get the data I need.
</p>

<p>
It's probably a reasonable assumption that each page renders the same
fields, but I'll err on the side of collecting more data and verify
that assumption later:
</p>

<div class="org-src-container">
<pre class="src src-javascript">var dict = {}
for( let l of links ) {
    await page.goto(l);
    await page.waitForTimeout(2000);
    const fieldElements = await page.$x("//table[@class=\"table-details\"]/tbody/tr/td[@class=\"dvHeader\"]");
    let fields = []
    for( let e of fieldElements ) {
        const field = await page.evaluate(el =&gt; el.textContent, e);
        fields.push(field)
    }
    const valueElements = await page.$x("//table[@class=\"table-details\"]/tbody/tr/td[not(@class)]");
    let vals = []
    for( let e of valueElements ) {
        const val = await page.evaluate(el =&gt; el.textContent, e);
        vals.push(val)
    }
    dict[p] = {
        Keys: fields,
        Vals: vals
    }
}
</pre>
</div>

<p>
Again, there's probably a lot of duplication here (the field names
should be the same for each page). But now I should have everything I
need. I'll just write it to a file<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> and then have a closer look
in a Node REPL:
</p>

<div class="org-src-container">
<pre class="src src-javascript">var fsp = require('fs/promises');
await fsp.writeFile("data.json",JSON.stringify(dict));
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ba326b" class="outline-2">
<h2 id="org7ba326b">Cleaning and Exporting</h2>
<div class="outline-text-2" id="text-org7ba326b">
<p>
I need to make sure I've got the same fields for each page, and then
I've got to export the data to Excel somehow: CSV seems like a good
option.
</p>

<p>
I'll get a Node REPL open and import the data<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>:
</p>
<div class="org-src-container">
<pre class="src src-javascript">const fs = require('fs');
let rawdata = fs.readFileSync('data.json');
let data = JSON.parse(rawdata);
</pre>
</div>

<p>
Now I can easily confirm that the keys are the same<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup> for each page in
the dictionary:
</p>

<div class="org-src-container">
<pre class="src src-javascript">let model = data[Object.keys(data)[0]].Keys
for ( let key of Object.keys(data) ) {
    let curr = data[key].Keys;
    if (!(model.length === curr.length &amp;&amp; model.every(function(value, index) { return value === curr[index]}) )) {
        console.log("uh oh");
    }
}
</pre>
</div>

<p>
No output! They're all the same (phew). We can easily construct the
CSV now, starting with the header:
</p>

<div class="org-src-container">
<pre class="src src-javascript">let fields = [];
for ( let field of data[Object.keys(data)[0]].Keys ) {
    fields.push("\"".concat(field.slice(0,-1),"\""))
}
let header = fields.join(",");
</pre>
</div>

<p>
Slicing removes colons, and enclosing quotation marks keep commas in
field names from poisoning the CSV. Now for the data:
</p>

<div class="org-src-container">
<pre class="src src-javascript">let rows = []
for ( key of Object.keys(data) ) {
    let vals = []
    for ( v of data[key].Vals ) {
        vals.push("\"".concat(v.trim(),"\""));
    }
    row = vals.join(",")
}
let csv = header.concat("\n",rows.join("\n"))
</pre>
</div>

<p>
All that's left is to export the file:
</p>

<div class="org-src-container">
<pre class="src src-javascript">var fsp = require('fs/promises')
await fsp.writeFile("data.csv", csv);
</pre>
</div>

<p>
Done!
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://stackoverflow.com/questions/24932391/are-custom-html-attributes-without-data-prefix-a-valid-attribute">https://stackoverflow.com/questions/24932391/are-custom-html-attributes-without-data-prefix-a-valid-attribute</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://stackoverflow.com/questions/47407791/how-to-click-on-element-with-text-in-puppeteer">https://stackoverflow.com/questions/47407791/how-to-click-on-element-with-text-in-puppeteer</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://www.folkstalk.com/2022/10/xpath-select-parent-node-based-on-child-node-with-code-examples.html">https://www.folkstalk.com/2022/10/xpath-select-parent-node-based-on-child-node-with-code-examples.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://stackoverflow.com/questions/1323755/xpath-how-to-select-nodes-which-have-no-attributes">https://stackoverflow.com/questions/1323755/xpath-how-to-select-nodes-which-have-no-attributes</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://stackoverflow.com/questions/72432428/i-am-getting-cb-argument-error-when-i-run-the-code">https://stackoverflow.com/questions/72432428/i-am-getting-cb-argument-error-when-i-run-the-code</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://stackabuse.com/reading-and-writing-json-files-with-node-js/">https://stackabuse.com/reading-and-writing-json-files-with-node-js/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://stackoverflow.com/questions/7837456/how-to-compare-arrays-in-javascriptk">https://stackoverflow.com/questions/7837456/how-to-compare-arrays-in-javascriptk</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p>hi</p>
</div>
</body>
</html>
